app/controllers/songs_controller.rb

  def index
    if params[:artist_id]
      @artist = Artist.find(params[:artist_id])
      if @artist
      @songs = @artist.songs
      elsif !@artist
        redirect_to artists_path
      end
    else
      @songs = Song.all
---
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 1]]
SELECT "songs".* FROM "songs" WHERE "songs"."artist_id" = ?  [["artist_id", 1]]